# The fastest shell plugin manager http://getantibody.github.io
brew "getantibody/tap/antibody"

# direnv is an environment switcher for the shell.
brew "direnv"

# Access GitHub's .gitignore boilerplates
# https://github.com/simonwhitaker/gibo
brew "gibo"

# enable transparent encryption/decryption for files in a git repo
# https://www.agwa.name/projects/git-crypt/
brew "git-crypt"

# Extensions to follow Vincent Driessen's branching model
# https://github.com/nvie/gitflow
brew "git-flow"

# GNU Pretty Good Privacy (PGP) package https://gnupg.org/
brew "gnupg", link: false

# Free (GNU) replacement for the Pico text editor
# https://www.nano-editor.org/
brew "nano"

# ui gpg pin entry
brew "pinentry-mac"

# Python version management https://github.com/pyenv/pyenv
brew "pyenv"

# Pyenv plugin to manage virtualenv https://github.com/pyenv/pyenv-virtualenv
brew "pyenv-virtualenv"

# Interpreted, interactive, object-oriented programming language
# https://www.python.org/
brew "python"

# Terminal multiplexer
# https://tmux.github.io/
brew "tmux"

# https://code.visualstudio.com
cask "visual-studio-code"

#########################
# GUI Applications
#########################

# Arduino IDE https://www.arduino.cc
cask "arduino"

# https://btcarmory.com
cask "armory"

# https://github.com/99designs/aws-vault
cask "aws-vault"

# https://bitwarden.com
cask "bitwarden"

# Dash gives your Mac instant offline access to 200+ API documentation sets.
# https://kapeli.com/dash
cask "dash"

# https://www.sourcegear.com/diffmerge
cask "diffmerge"

# https://www.docker.com/community-edition
cask "docker"

# https://www.dropbox.com
cask "dropbox"

tap "homebrew/cask-fonts"
cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-hack-nerd-font"

# https://www.gimp.org
cask "gimp"

# Google Chrome web Browser
# https://www.google.com/chrome/
cask "google-chrome"

# https://gpgtools.org
cask "gpg-suite"

# http://growl.info/downloads
cask "growlnotify"

# itsycal is a nice menu bar clock replacement that features a calendar with events from iCal
# https://www.mowglii.com/itsycal/
cask "itsycal"

# https://www.iterm2.com
cask "iterm2"

# https://keybase.io
cask "keybase"

# http://kicad-pcb.org
cask "kicad"

# https://www.amazon.com/gp/digital/fiona/kcp-landing-page
cask "kindle"

# NodeJS Version Manager
# - POSIX-compliant bash script to manage multiple active node.js versions
brew "nvm"

# https://osxfuse.github.io/
cask "osxfuse"

# https://signal.org
cask "signal"

# slack team chat https://slack.com
cask "slack"

# osx window management/tiling
# https://www.spectacleapp.com
cask "spectacle"

# multiformat decompression utility
# https://theunarchiver.com
cask "the-unarchiver"

# https://www.git-tower.com
# cask "tower"

# bittorrent client
# https://transmissionbt.com
cask "transmission"

# VPN client
# https://www.tunnelblick.net
cask "tunnelblick"

# https://www.vagrantup.com
cask "vagrant"

# virtualbox to handle virtual machines
cask "virtualbox"
cask "virtualbox-extension-pack"

# https://www.videolan.org/vlc
cask "vlc"

# https://www.xquartz.org
cask "xquartz"
