# Search tool like grep, but optimized for programmers
# http://beyondgrep.com/
brew "ack"

# CloudFlare's PKI toolkit
# https://cfssl.org/
brew "cfssl"

# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
# https://clang.llvm.org/docs/ClangFormat.html
brew "clang-format"

# GNU File, Shell, and Text utilities
# https://www.gnu.org/software/coreutils
brew "coreutils"

# XML-based font configuration API for X Windows
# https://wiki.freedesktop.org/www/Software/fontconfig/
brew "fontconfig"

# Collection of GNU find, xargs, and locate
# https://www.gnu.org/software/findutils/
brew "findutils"

# GNU awk utility
# https://www.gnu.org/software/gawk/
brew "gawk"

# enable transparent encryption/decryption for files in a git repo
# https://www.agwa.name/projects/git-crypt/
brew "git-crypt"

# GNU implementation of the famous stream editor
# https://www.gnu.org/software/sed/
brew "gnu-sed" #, args: [ "--with-default-names" ]

# GNU implementation of which utility
# https://savannah.gnu.org/projects/which/
brew "gnu-which"

# GNU Pretty Good Privacy (PGP) package
# https://gnupg.org/
brew "gnupg", link: false

# GNU grep, egrep and fgrep
# https://www.gnu.org/software/grep/
brew "grep"

# Improved top (interactive process viewer)
# https://hisham.hm/htop/
brew "htop"

# Tools and libraries to manipulate images in many formats
# https://www.imagemagick.org/
brew "imagemagick"

# Tool to capture still images from an iSight or other video source
# https://iharder.sourceforge.io/current/macosx/imagesnap/
brew "imagesnap"

# CLI wrapper for basic network utilities on Mac OS X inspired with iproute2 on Linux systems
# https://github.com/brona/iproute2mac
brew "iproute2mac"

# Sophisticated file transfer program
# https://lftp.yar.ru/
brew "lftp"

# Utility for directing compilation
# https://www.gnu.org/software/make/
brew "make"

# A simple command line interface for the Mac App Store.
# https://github.com/mas-cli/mas
brew "mas"

# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
# http://www.mutt.org/
brew "mutt"

# RSS/Atom feed reader for text terminals
# https://newsboat.org/
brew "newsboat"

# Tools for one-time password authentication systems
# https://www.nongnu.org/oath-toolkit/
brew "oath-toolkit"

# Pinentry for GPG on Mac
# https://github.com/GPGTools/pinentry-mac
brew "pinentry-mac"

# Monitor data's progress through a pipe
# https://www.ivarch.com/programs/pv.shtml
brew "pv"

# Library for command-line editing
# https://tiswww.case.edu/php/chet/readline/rltop.html
brew "readline"

# Utility that provides fast incremental file transfer
# https://rsync.samba.org/
brew "rsync"

# Terminal multiplexer with VT100/ANSI terminal emulation
# https://www.gnu.org/software/screen
brew "screen"

# CLI that provides on-demand secrets access for common DevOps tools.
# https://github.com/cyberark/summon
tap "cyberark/tools"
brew "summon"

# Display directories as trees (with optional color/HTML output)
# http://mama.indstate.edu/users/ice/tree/
brew "tree"

# Terminal interaction recorder and player
# http://0xcc.net/ttyrec/
brew "ttyrec"

# Ncurses based file manager with vi like keybindings
# https://vifm.info/
brew "vifm"

# Executes a program periodically, showing output fullscreen
# https://gitlab.com/procps-ng/procps
brew "watch"

# Watch files and take action when they change
# https://github.com/facebook/watchman
brew "watchman"

# Internet file retriever
# https://www.gnu.org/software/wget/
brew "wget", arge: [ "--with-iri" ]

# YubiKey personalization library and tool
# https://developers.yubico.com/yubikey-personalization/
brew "ykpers"

# Additional completion definitions for zsh
# https://github.com/zsh-users/zsh-completions
brew "zsh-completions"

#########################
# GUI Applications
#########################

# Arduino IDE
# https://www.arduino.cc
cask "arduino"

# Python-based fully-featured Bitcoin Wallet Software
# https://btcarmory.com
cask "armory"

# A vault for securely storing and accessing AWS credentials in development environments
# https://github.com/99designs/aws-vault
cask "aws-vault"

# Open Source Password Management
# https://bitwarden.com/
cask "bitwarden"

# DiffMerge is an application to visually compare and merge files on Windows, OS X and Linux.
# https://www.sourcegear.com/diffmerge
cask "diffmerge"

# The Industry-Leading Container Runtime
# https://www.docker.com/community-edition
cask "docker"

# it's dropbox yo
# https://www.dropbox.com
cask "dropbox"

tap "homebrew/cask-fonts"
cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-hack-nerd-font"

# The Free & Open Source Image Editor
# https://www.gimp.org
cask "gimp"

# Google Chrome web Browser
# https://www.google.com/chrome/
cask "google-chrome"

# One simple package with everything you need, to protect your emails and files.
# https://gpgtools.org
cask "gpg-suite"

# The Untimate Notification system for OS X
# http://growl.info/downloads
cask "growlnotify"

# A terminal emulator for OS X that does amazing things
# https://www.iterm2.com
cask "iterm2"

# End-to-end encryption for things that matter.
# https://keybase.io
cask "keybase"

# A Cross Platform and Open Source Electronics Design Automation Suite
# http://kicad-pcb.org
cask "kicad"

# Amazon book reading app
# https://www.amazon.com/gp/digital/fiona/kcp-landing-page
cask "kindle"

# One command for an instant, secure URL to your localhost server through any NAT or firewall.
# https://ngrok.com/
cask "ngrok"

# File system integration made easy
# https://osxfuse.github.io/
cask "osxfuse"

# QLColorCode Quick Look plugin for source code with syntax highlighting.
# https://github.com/anthonygelibert/QLColorCode
cask "qlcolorcode"

# QuickLook plugin to display the dimensions, size and DPI of an image
# https://github.com/Nyx0uf/qlImageSize
cask "qlimagesize"

# QuickLook generator for Markdown files.
# https://github.com/toland/qlmarkdown
cask "qlmarkdown"

# A QuickLook plugin that lets you view plain text files without a file extension
# https://whomwah.github.io/qlstephen/
cask "qlstephen"

# quicklook plugin to display thumbnails, static QuickLook previews, cover art and metadata for most types of video files.
# https://github.com/Marginal/QLVideo
cask "qlvideo"

# A quicklook plugin to preview json files
# http://www.sagtau.com/quicklookjson.html
cask "quicklook-json"

# Say "hello" to a different messaging experience.
# An unexpected focus on privacy, combined with all of the features you expect.
# https://signal.org
cask "signal"

# slack team chat
# https://slack.com
cask "slack"

# osx window management/tiling
# https://www.spectacleapp.com
cask "spectacle"

# Quicklook plugin to inspect package files
# https://www.mothersruin.com/software/SuspiciousPackage/
cask "suspicious-package"

# multiformat decompression utility
# https://theunarchiver.com
cask "the-unarchiver"

# A GUI for GIT
# https://www.git-tower.com
# cask "tower"

# bittorrent client
# https://transmissionbt.com
cask "transmission"

# Tunnelblick helps you control OpenVPN® VPNs on macOS
# https://www.tunnelblick.net
cask "tunnelblick"

# Development Environments Made Easy
# https://www.vagrantup.com
cask "vagrant"

# VirtualBox is a powerful x86 and AMD64/Intel64 virtualization product
# https://www.virtualbox.org/
cask "virtualbox"

# Oracle VirtualBox Extension Pack
# https://www.virtualbox.org/
cask "virtualbox-extension-pack"

# VLC is a free and open source cross-platform multimedia player and framework
# https://www.videolan.org/vlc
cask "vlc"

# The XQuartz project is an open-source effort to develop a version of the X.Org X Window System that runs on OS X.
# https://www.xquartz.org
cask "xquartz"
